kbhse/ESP8266_WeatherStation_MQTT/src/main.cpp
#define PROGNAM "ESP8266_WeatherStation_MQTT"                                                       // program name
#define VERSION "v04.07"                                                                            // program version (nb lowercase 'version' is keyword)
#define PGMFUNCT "Temperature, Humidity, Pressure, Light Intensity, Wind"                           // what the program does
#define HARDWARE "Wemos D1 mini or pro with sensors and shields"                                    // hardware version
#define AUTHOR "J Manson"                                                                           // created by
#define CREATION_DATE "Feb 2020"                                                                    // date
//#define DEBUG_OUT

#include <Arduino.h>
#include <ESP8266WiFi.h>
#include "SimpleTimer.h"                                                                            // https://playground.arduino.cc/Code/SimpleTimer/ https://github.com/marcelloromani/arduino/tree/master/SimpleTimer
#include "WEMOS_SHT3X.h"                                                                            // Wemos Temperature and Humidity shield library
#include "PubSubClient.h"                                                                           // https://github.com/knolleary/pubsubclient
#include "SoftwareSerial.cpp"                                                                       // https://github.com/plerup/espsoftwareserial
                                                                                                    // NB ESP needs this version of SoftwareSerial !! (and needs to be in PLatform IO lib)
// MQTT code from: https://randomnerdtutorials.com/raspberry-pi-publishing-mqtt-messages-to-esp8266/
//                 https://github.com/knolleary/pubsubclient

// ------------------------------------------------------------------
// Pins


// ------------------------------------------------------------------

/* Changelog
04.00 average 10 samples
04.02 add routines to change update frequency from Node RED via MQTT
04.03 temporarily disable the averaging routine
04.04 fix esp8266 broadcasting unwanted open wifi network (in setup_wifi())
04.05 add credentials for BTHub6-7N5K
04.06 fix routines to change update frequency from Node RED via MQTT
04.07 adding RS485 wind sensors
04.08 windspeed implemented, publishing to MQTT
*/

/*
ToDo:
set limits for sensor updateFreqs based on response times
remove averaging and median filters. just send raw data at updateFreq
(raw data to database, smoothing in Node RED)
*/

// ------------------------------------------------------------------
// unique number for each ESP8266 device and edit the next 2 #defines accordingly
#define MQTT_DEVICE "esp09"                                                                         // MQTT requires unique device ID (see reconnect() function)
#define PUB_SUB_CLIENT esp09client                                                                  // and unique client ?
#define MQTT_LOCATION "windMast"                                                                    // location for MQTT topic
//#define UPDATE_FREQ 60000L                                                                          // 60 seconds

long updateFreq = 0;                                                                                // the update frequency for sensors and publish to MQTT
int timerID;

// ------------------------------------------------------------------
// MQTT
const char* mqtt_server = "192.168.1.100";
const int mqttPort = 1883;
const char* mqttUser = "mqttUser2";
const char* mqttPassword = "jR5b73Wklx";

/*
const char* mqtt_server = "192.168.1.74";
const int mqttPort = 1883;
const char* mqttUser = "mqttUser";
const char* mqttPassword = "hTR7gxBY4";
*/

// ------------------------------------------------------------------
// Comment out sensors not in use

//#define WEMOS_SHT30                                                                                 // Wemos Temperature and Humidity shield
//#define WEMOS_HP303                                                                                 // Wemos Barometric Pressure Shield
//#define WEMOS_BH1750                                                                                // Wemos Ambient Light Shield
//#define WEMOS_BATTERY                                                                               // Wemos Battery Shield
//#define RSSI                                                                                        // ESP8266 WiFi RSSI
#define RS485_WIND                                                                                  // Anemometer and Wind Direction

// -----------------------------------------------------------------
// define which WiFi network to connect to (only 1 should be active)

//#define BTHUB
#define BTHUB6
//#define LINKSYS

#ifdef BTHUB                                                                                        // Weights Room
    const char* ssid = "BTHub4-5H9P";                                                               // BTHub WiFi credentials
    const char* password = "nB67c3zuRlPrAVcZL5YN";
#endif

#ifdef BTHUB6                                                                                       // Weights Room
    const char* ssid = "BTHub6-7N5K";                                                               // new BTHub WiFi credentials
    const char* password = "QeC3RCJGeUvx";
#endif

#ifdef LINKSYS                                                                                      // Garage
    const char* ssid = "linksys";                                                                   // BTHub WiFi credentials
    const char* password = "rhenigidale";
#endif

// -----------------------------------------------------------------
// Initializes the espClient. You should change the espClient name if you have multiple ESPs running in your home automation system
//WiFiClient espClient;
WiFiClient PUB_SUB_CLIENT;
PubSubClient client(PUB_SUB_CLIENT);

// Lamp - LED - GPIO 4 = D2 on ESP-12E NodeMCU board
const int lamp = LED_BUILTIN;

// ------------------------------------------------------------------

#ifdef WEMOS_SHT30
    #include <WEMOS_SHT3X.h>                                                                        // Wemos Temperature and Humidity shield
    SHT3X sht30(0x45);                                                                              // SHT30 shield has two user selectable I2C addresses
    //static char sht_temperature[7];
    //static char sht_humidity[7];
#endif

