kbhse/ESP8266_WeatherStation_MQTT/src/main.cpp
#ifdef WEMOS_HP303
    #include <LOLIN_HP303B.h>                                                                       // Wemos Barometric Pressure HP303B Shield https://github.com/wemos/LOLIN_HP303B_Library
    LOLIN_HP303B HP303B;
#endif

#ifdef WEMOS_BH1750                                                                                 // Wemos Ambient Light Shield
    #include <BH1750.h>                                                                             // ambient light sensor https://github.com/claws/BH1750
    BH1750 lightMeter(0x23);                                                                        // BH1750 can be configured to use two I2C addresses, 0x23 (default)or 0x5C
#endif

#ifdef RS485_WIND
    //const byte anemometerInquiryFrame[] = {0x01, 0x03, 0x00, 0x16, 0x00, 0x01, 0x65, 0xCE};            // Anemometer Inquiry frame
    //const byte windDirectionInquiryFrame[] = {0x02, 0x03, 0x00, 0x00, 0x00, 0x01, 0x84, 0x39};         // Wind Direction Sensor Inquiry frame
    byte responseFrameBuff[7] = {};                                                                    // buffer for receiving response frame from sensors
    //long updateFreq;                                                                                   // sensor update frequency (millis)
    float windSpeed;

    #define rxPin D7                                                                                  // SoftwareSerial receive pin
    #define txPin D6                                                                                  // SoftwareSerial transmit pin
    #define rtsPin D5                                                                                 // RS485 RTS direction control
    #define transmit HIGH
    #define receive LOW
    #define ledPin D4

    SoftwareSerial RS485(rxPin, txPin);                                                                // instantiate SoftwareSerial object

    // anemometer type B - not used
    // const byte anemometerInquiryFrame[] = {0x01, 0x03, 0x00, 0x16, 0x00, 0x01, 0x65, 0xCE};            // Anemometer Inquiry frame

    /*
    Anemometer on address 0x03
                              bytes
    device address:             1   0x03
    function number:            1   0x03
    start register address:     2   0x0000
    number of registers:        2   0x0001
    CRC-16/MODBUS               2   0x85E8
    */
    const byte anemometerInquiryFrame[] = {0x03, 0x03, 0x00, 0x00, 0x00, 0x01, 0x85, 0xE8};
    /*
    the response frame should be:
                              bytes
    device address:             1   0x03
    function number:            1   0x03
    number of valid bytes       1   0x02
    data:                       2   0x0008
    CRC-16/MODBUS               2   0xC042          ** check this!

    data / 10 => speed m/s (0.8 m/s)

    range:              0 - 32.4 m/s
    precision:          0.3 m/s
    start speed:        0.8 m/s
    */

    /*
    Wind Direction Sensor on address 0x02
    */
    const byte windDirectionInquiryFrame[] = {0x02, 0x03, 0x00, 0x00, 0x00, 0x01, 0x84, 0x39};         // Wind Direction Sensor Inquiry frame

    /*
    Modbus Device address can be set to 0-255. You can set a new address by transmitting a frame
    with the first byte (the device address) set to 0x00. **Only do this with 1 device on the bus!
    Eg to set a device to address 3:
                          bytes
    device address:             1   0x00
    function number:            1   0x16
    start register address:     2   0x1000
    number of registers:        2   0x0001
    number of valid bytes       1   0x02
    SET new device address:     2   0x0003
    CRC-16/MODBUS               2   0x7A2A

    const byte modifyDeviceAddressFrame[] = {0x00, 0x16, 0x10, 0x00, 0x00, 0x01, 0x02, 0x00, 0x03, 0x7A, 0x2A};

    CRC-16/MODBUS use this calculator: https://crccalc.com/
    the CRC is sent little-endian (low byte first)

    the response frame should be:
                              bytes
    device address:             1   0x00
    function number:            1   0x16
    start register address:     2   0x1000
    number of registers:        2   0x0001
    CRC-16/MODBUS               2   0x8CD8
    */

#endif

// ------------------------------------------------------------------

SimpleTimer timer;

// ------------------------------------------------------------------
// This functions reconnects your ESP8266 to your MQTT broker
// Change the function below if you want to subscribe to more topics with your ESP8266 
    void reconnect()
    {
    // Loop until we're reconnected
    while (!client.connected())
        {
        Serial.print("Attempting MQTT connection...");
        // Attempt to connect
        /*
        YOU MIGHT NEED TO CHANGE THIS LINE, IF YOU'RE HAVING PROBLEMS WITH MQTT MULTIPLE CONNECTIONS
        To change the ESP device ID, you will have to give a new name to the ESP8266.
        Here's how it looks:
            if (client.connect("ESP8266Client")) {
        You can do it like this:
            if (client.connect("ESP1_Office")) {
        Then, for the other ESP:
            if (client.connect("ESP2_Garage")) {
        That should solve your MQTT multiple connections problem
        */
        if (client.connect(MQTT_DEVICE, mqttUser, mqttPassword))
            {
            Serial.println("connected");  
            // Subscribe or resubscribe to a topic
            // You can subscribe to more topics (to control more LEDs in this example)
            client.subscribe(MQTT_LOCATION "/lamp");
            //client.subscribe(MQTT_LOCATION "/freq");
            client.subscribe("update/Freq/" MQTT_LOCATION);
            }
        else
            {
            Serial.print("failed, rc=");
            Serial.print(client.state());
            Serial.println(" try again in 5 seconds");
            // Wait 5 seconds before retrying
            delay(5000);
            }
        }
    }

// ------------------------------------------------------------------
void setup_wifi()
    {
    delay(10);
    // We start by connecting to a WiFi network
    Serial.println();
    Serial.print("Connecting to ");
    Serial.println(ssid);
    WiFi.begin(ssid, password);
    // the next line to fix esp8266 broadcasting unwanted open wifi network
    // it is placed AFTER WiFi.begin() !!
    // see: https://forum.arduino.cc/index.php?topic=501263.0 and https://github.com/esp8266/Arduino/issues/549
    WiFi.mode(WIFI_STA);
    while (WiFi.status() != WL_CONNECTED)
        {
        delay(500);
        Serial.print(".");
        }
    Serial.println("");
    Serial.print("WiFi connected - ESP IP address: ");
    Serial.println(WiFi.localIP());
    }

// ------------------------------------------------------------------

void combSort11(float *ar, uint8_t n)                                                               // this was used for median when temp samples stored in array
{
  uint8_t i, j, gap, swapped = 1;
  float temp;

  gap = n;
  while (gap > 1 || swapped == 1)
  {
    gap = gap * 10 / 13;
    if (gap == 9 || gap == 10) gap = 11;
    if (gap < 1) gap = 1;
    swapped = 0;
    for (i = 0, j = gap; j < n; i++, j++)
    {
      if (ar[i] > ar[j])
      {
        temp = ar[i];
        ar[i] = ar[j];
        ar[j] = temp;
        swapped = 1;
      }
    }
  }
}

// ------------------------------------------------------------------
// read the sensors and publish to MQTT
// called by timer @ updateFreq

