kbhse/ESP8266_WeatherStation_MQTT/src/main.cpp
void readSensors()
    {                                                                                               // function: reads sensors and sends data to blynk app
	
    #ifdef WEMOS_SHT30                                                                              // temperature and humidity
        #ifdef DEBUG_OUT
            Serial.println(F("Reading the SHT30: "));
        #endif
        static char temperatureTemp[7];                                                             // client.publish() expects char array
        static char humidityTemp[7];
        float temperature = 0;
        float humidity = 0;
        /*
        float averageTemperature = 0;
        float averageHumidity = 0;
        // get average of 10 consecutive readings
        // there is a 500ms delay in call to sht30 so loop takes 5 seconds !!
        for(int i = 0; i < 10; i++)
            {
            sht30.get();
            averageTemperature += sht30.cTemp;
            averageHumidity += sht30.humidity;
            yield();
            }
        averageTemperature /= 10;
        averageHumidity /= 10;
        // publish average temperature to mqtt
        dtostrf(averageTemperature, 6, 2, temperatureTemp);                                         // convert float to char array
        dtostrf(averageHumidity, 6, 2, humidityTemp);
        */
        sht30.get();
        temperature += sht30.cTemp;
        humidity += sht30.humidity;
        dtostrf(temperature, 6, 2, temperatureTemp);                                                // convert float to char array
        dtostrf(humidity, 6, 2, humidityTemp);

        client.publish(MQTT_LOCATION "/temperature", temperatureTemp);
        client.publish(MQTT_LOCATION "/humidity", humidityTemp);
        #ifdef DEBUG_OUT
            Serial.print("Temperature: ");
            Serial.println(temperatureTemp);
            Serial.print("Humidity: ");
            Serial.println(humidityTemp);
        #endif
    #endif

    #ifdef WEMOS_HP303
        #ifdef DEBUG_OUT
            Serial.println(F("Reading the HP303B: "));
        #endif
        int32_t pressure;
        float hPa;
        static char hPaTemp[7];
        HP303B.measurePressureOnce(pressure);                                                       // read the barometric pressure
        hPa = pressure / 100.0;                                                                     // convert to hPa (note 100.0 for cast to float)
        #ifdef DEBUG_OUT
            Serial.println(hPa);
        #endif
        dtostrf(hPa, 6, 1, hPaTemp);
        client.publish(MQTT_LOCATION "/pressure", hPaTemp);
    #endif

    #ifdef WEMOS_BH1750
        #ifdef DEBUG_OUT
            Serial.println(F("Reading the BH1750: "));
        #endif
        uint16_t lux = lightMeter.readLightLevel();                                                 // read the light level
        static char luxStr[5];
        itoa(lux, luxStr, 10);
        client.publish(MQTT_LOCATION "/light", luxStr);
    #endif
/*
    #ifdef RSSI
        int rssi = WiFi.RSSI();                                                                     // get RSSI (received signal strength indicator) of WiFi connection
        static char rssiStr[5];
        itoa(rssi, rssiStr, 10);
        client.publish(MQTT_LOCATION "/rssi", rssiStr);
    #endif

    #ifdef WEMOS_BATTERY
        int adc = analogRead(0);                                                                    // read the ESP ADC (connected to battery)
        float v = (adc * 4.335) / 1024;                                                             // calculate the voltage (fsd 4.335v)
        Blynk.virtualWrite(V47, v);                                                                 // send to app
    #endif
*/
    #ifdef RS485_WIND

        digitalWrite(rtsPin, transmit);                                                                // init transmission
        RS485.write(anemometerInquiryFrame, sizeof(anemometerInquiryFrame));                           // send the Inquiry
        RS485.flush();                                                                                 // Wait for the transmission to complete

        digitalWrite(rtsPin, receive);                                                                 // init receive
        //responseFrameBuff[] = {};                                                                      // clear the buffer
        //memset(responseFrameBuff, 0, sizeof(responseFrameBuff));
        RS485.readBytes(responseFrameBuff, 7);                                                         // read the data
        
        static char speedTemp[6];                                                                      // client.publish() expects char array
        int speed = responseFrameBuff[3] * 256 + responseFrameBuff[4];                                 // high low bytes
        itoa(speed, speedTemp, 10);                                                                    // convert float to char array
        client.publish(MQTT_LOCATION "/windSpeed", speedTemp);                                         // publish to MQTT, topic /windSpeed

        #ifdef DEBUG_OUT
            Serial.print("wind speed: ");
            for(byte i = 0; i < 7; i++)
                {
                Serial.print(responseFrameBuff[i], HEX);
                Serial.print(" ");
                }
            Serial.print(" ==> ");
            windSpeed = responseFrameBuff[4] / 10.0;
            Serial.print(windSpeed);
            Serial.println(" m/s");
        #endif
    #endif

  	} // end of readSensors()

// ------------------------------------------------------------------
// This functions is executed when a device publishes a message to a topic that an ESP8266 is subscribed to
// Change the function below to add logic to the program, so when a device publishes a message to a topic that 
// an ESP8266 is subscribed to it can do something
void callback(String topic, byte* message, unsigned int length)
    {
    Serial.print("Message arrived on topic: ");
    Serial.print(topic);
    Serial.print(". Message: ");
    String messageTemp;
  
    for (int i = 0; i < length; i++)
        {
        Serial.print((char)message[i]);
        messageTemp += (char)message[i];
        }
    Serial.println();

