kbhse/ESP8266_WeatherStation_MQTT/src/main.cpp
    // Feel free to add more if statements to control more GPIOs with MQTT

    // If a message is received on the topic room/lamp, you check if the message is either on or off. Turns the lamp GPIO according to the message
    // NB need to subscribe to topics in reconnect() !!

    //if(topic == MQTT_LOCATION "/freq")
    if(topic == "update/Freq/" MQTT_LOCATION)
        {
        updateFreq = messageTemp.toInt();
        Serial.print("freq: ");
        Serial.println(updateFreq);
        if(timer.isEnabled(timerID))                                                                // if timer has already been started (in setup())
            {
            timer.deleteTimer(timerID);
            timerID = timer.setInterval(updateFreq, readSensors);                                   // restart timer with new updateFreq
            }
        }

    if(topic == MQTT_LOCATION "/lamp")
        {
        Serial.print("Changing Room lamp to ");
        if(messageTemp == "on")
            {
            digitalWrite(lamp, LOW);                                                                // active LOW
            Serial.print("On");
            }
        else if(messageTemp == "off")
            {
            digitalWrite(lamp, HIGH);
            Serial.print("Off");
            }
        }
        Serial.println();
    }

// ------------------------------------------------------------------
void setup()
    {

    Serial.begin(115200);
    Serial.printf("\n\n%s_%s, %s, %s, %s\n\n", PROGNAM, VERSION, AUTHOR, CREATION_DATE, MQTT_DEVICE);

    pinMode(lamp, OUTPUT);

    setup_wifi();
    client.setServer(mqtt_server, mqttPort);
    client.setCallback(callback);

    #ifdef WEMOS_HP303                                                                              // Wemos Barometric Pressure HP303B Shield
        HP303B.begin();                                                                             // I2C address = 0x77 (or HP303B.begin(0x76); //I2C address = 0x76)
    #endif

    #ifdef WEMOS_BH1750
        if (lightMeter.begin(BH1750::CONTINUOUS_HIGH_RES_MODE))                                     // begin returns a boolean that can be used to detect setup problems
            {
            Serial.println(F("BH1750 Advanced begin"));
            }
        else
            {
            Serial.println(F("Error initialising BH1750"));
            }
    #endif

    #ifdef RS485_WIND
        pinMode(rtsPin, OUTPUT);
        pinMode(ledPin, OUTPUT);
        RS485.begin(9600);
        delay(1000);
    #endif

    if (!client.connected())
        {
        reconnect();
        }

    // request the update frequency (from Node RED)
    //client.publish(MQTT_LOCATION "/update", "freq");
    client.publish( "update/getFreq", MQTT_LOCATION);

    // wait for MQTT to publish the update frequency
    Serial.println("waiting for MQTT to publish the update frequency");
    while (updateFreq == 0) 
        {
        Serial.print(".");
        delay(500);
        client.loop();
        //yield();
        }
    //Serial.print("freq: ");
    //Serial.println(updateFreq);
 
    // start the timer
    timerID = timer.setInterval(updateFreq, readSensors);                                           // every x milliseconds, send data to MQTT

    Serial.print("timerID: ");
    Serial.println(timerID);

    } // end of setup()

// ------------------------------------------------------------------
void loop()
    {

    if (!client.connected())
        {
        reconnect();
        }
    if (!client.loop())
        {
        client.connect(MQTT_DEVICE);
        }

    timer.run();

    } // end of loop()

// ------------------------------------------------------------------


/*
        // read 11 temperature measurements to array
        // there is a 500ms delay in call to sht30 so loop takes 5.5 seconds !!
        float temperature[11];
        //Serial.println(millis());
        for(int i = 0; i < 11; i++)
            {
            sht30.get();
            temperature[i] = sht30.cTemp;
            yield();
            }

        // use mid element of array as unsmoothed sample
        dtostrf(temperature[5], 6, 2, temperatureTemp);
        client.publish(MQTT_LOCATION "/temperature", temperatureTemp);  // and publish it to MQTT

        // print results array to console
        #ifdef DEBUG_OUT
            for(int i = 0; i < 11; i++)
                {
                Serial.print(i);
                Serial.print(": ");
                Serial.println(temperature[i]);
                }
        #endif

        // find highest and lowest values (outliers)
        int hi = 0, lo = 0;
        for(int i = 1; i <= 9; i++)
            {
            if(temperature[i] > temperature[hi])
                {
                hi = i;
                }
            if(temperature[i] < temperature[lo])
                {
                lo = i;
                }
            }
        // reject outliers
        temperature[hi] = 0;
        temperature[lo] = 0;

        // calc average of 11 values
        float averageTemperature = 0;
        for(int i = 0; i < 11; i++)
            {
            averageTemperature += temperature[i];
            }
        averageTemperature /= 11;

        #ifdef DEBUG_OUT
            Serial.println();
            Serial.print("average: ");
            Serial.println(averageTemperature);
            Serial.println();
        #endif

        combSort11(temperature, 11);
        // print results to console
        #ifdef DEBUG_OUT
            for(int i = 0; i < 11; i++)
                {
                Serial.print(i);
                Serial.print(": ");
                Serial.println(temperature[i]);
                }
        #endif
        float medianTemperature = temperature[5];

        // publish median temperature to mqtt
        dtostrf(medianTemperature, 6, 2, temperatureTemp);
        client.publish(MQTT_LOCATION "/medianTemperature", temperatureTemp);

        #ifdef DEBUG_OUT
            Serial.println();
            Serial.print("median: ");
            Serial.println(medianTemperature);
            Serial.println();
        #endif
*/